import React, { Fragment } from "react";

const Section3Rule = () => {
  return (
    <Fragment>
      <a name="rule" href="!#">
        {" "}
      </a>
      <section className="sec3">
        <p className="sec-title"></p>
        <div className="rule-box">
          <div className="rule-con">
            <p className="match-rule">萬聖狂歡盃 賽制規章</p>
            <p>
              本次第五人格【萬聖狂歡盃-
              好膽你就來】由預賽、八強至四強以及冠軍賽三個階段組成，所有的報名隊伍在進入八強賽階段前皆為BO1單淘汰賽，晉級至八強賽及四強賽的隊伍進行BO3賽事，最終冠軍賽進行BO5賽事。
              <br />
              其中八強賽、四強賽及冠軍賽皆為線下棚內賽事，晉級隊伍需出場至指定場所出賽。由於目前還處疫情期間，為配合政府防疫措施，故此次賽事除比賽選手及現場工作人員外，皆不開放任何觀眾入場，賽事期間還請利用官方直播平台觀看。{" "}
            </p>
            <p className="rule-title">✦預賽</p>
            <p>
              預賽階段為單敗淘汰賽制，所有報名隊伍經官方抽籤分配後，進行樹狀淘汰賽，此為線上進行。
            </p>
            <br />
            <p className="rule-title">✦八強賽及四強賽</p>
            <p>
              八強及四強賽階段為 BO3
              淘汰賽制，晉級的八支隊伍根據淘汰賽晉級的樹狀圖繼續對戰。八強賽、四強賽與冠軍賽隊伍選手皆須於賽程時間1小時前至指定現場報到及準備出賽並配合線上轉播。
            </p>
            <p className="match-rule">比賽規則</p>
            <p className="rule-title">✦比賽版本</p>
            <p> 本次賽事統一使用台港澳伺服器最新版本。</p>
            <br />
            <p className="rule-title">✦比賽模式</p>
            <p> 比賽採用自訂模式進行，且同一局比賽中不能出現重複的角色。 </p>
            <br />
            <p className="rule-title">✦比賽形式</p>
            <p>
              {" "}
              每局比賽（即一個 BO）分為上半場及下半場，上半場由 A
              隊伍的四名求生者對抗 B 隊伍的一名監管者，下半場則由 B
              隊伍的四名求生者對抗 A 隊伍的一名監管者。
            </p>
            <br />
            <p className="rule-title">✦選手報到</p>
            <p>
              {" "}
              【線上預賽】裁判會透過隊伍報名時的隊長信箱及 LINE ID
              進行聯繫，並在公布賽程後以信件的方式告知報到時間，線上賽以 LINE
              群的報到回應為準。
            </p>
            <p>
              【八強後線下賽】隊伍所有隊員需遵守賽事官方指定時間至指定現場進行報到流程，隊員需5人以上到場才可完成報名，如逾指定時間尚未完成報名之隊伍，視同棄賽。
            </p>
            <br />
            <p className="rule-title">✦獎金發放</p>
            <p>
              {" "}
              賽事官方會依據最終獲勝的隊伍進行獎金發放，由隊伍提交正確無誤的所需資料後，在
              30
              個工作天內將獎金匯款至隊長帳戶，所有成員需與隊長進行獎金分配等事宜，官方不負擔任何責任。若有隊伍發生侵占等相關訴訟，需自行承擔法律責任。獎金稅務方面，將依得獎隊伍所在地相關法令，依法扣除相關稅金後發放，以台灣為例：依中華民國稅法規定，本活動機會中獎獎勵價值若超過新台幣
              2 萬元（含），將由主辦單位代扣 10% 機會中獎稅。
              機會中獎獎品價值如超過 $1,000
              元以上者，依法需納入年度個人綜合所得總額進行申報，扣繳憑單將由主辦單位寄發予得獎者，請務必據實申報；中獎者需提供並填寫中獎者資料，繳交身分證正反面影本。如中獎者不同意繳交稅款或提供領獎所需資料，則視為放棄領獎資格。
            </p>
            <br />
            <p className="rule-title">✦地圖選擇</p>
            <p>
              可選地圖：軍工廠，紅教堂，聖心醫院，湖景村，月亮河公園，里奧的回憶。
              <br />
              選擇規則：同一場比賽內，每支隊伍不能選擇本隊在本場比賽中已選擇過的地圖。
              <br />
              選擇順序：每場比賽開始前，由裁判聯繫雙方隊伍進行線上猜拳，（或其他裁判指定的形式），猜拳獲勝者選擇第一局比賽地圖，失敗者選擇陣營出場順序，隨後雙方每輪依次交換選擇順序。其中，每局比賽的上下半場比賽地圖一致。
            </p>
            <br />
            <p className="rule-title">✦BP 規則</p>
            <p>
              {" "}
              角色禁用規則，進行至BO3賽事後需在每局開始前告知裁判禁用角色。
              <br />
              BO1 賽事
              <br />
              無禁用角色
              <br />
              BO3 賽事 (八強及四強)
              <br />
              第一局：求生者方無需禁用角色，監管者方禁用 1 名角色
              <br />
              第二局：求生者方禁用 1 名角色，監管者方禁用 2 名角色
              <br />
              第三局：求生者方禁用 2 名角色，監管者方禁用 3 名角色
              <br />
              BO5 賽事 (冠軍賽)
              <br />
              第一局：求生者方無需禁用角色，監管者方禁用 1 名角色
              <br />
              第二局：求生者方禁用 1 名角色，監管者方禁用 2 名角色
              <br />
              第三局：求生者方禁用 2 名角色，監管者方禁用 3 名角色
              <br />
              第四局：求生者方禁用 3 名角色，監管者方禁用 4 名角色
              <br />
              第五局：求生者方禁用 3 名角色，監管者方禁用 4 名角色
              <br />
              其中，每一局比賽的上下半場均需重新禁用角色。
              <br />
              角色 BP 順序
              <br />
              每一場的 BP 順序固定為 1-1-1-1，即：求生者禁用監管者陣營 -
              監管者禁用求生者陣營 - 所有求生者選擇角色 - 監管者選擇角色。
              <br />
              角色限制
              <br />
              目前版本未加入排位赛之角色，皆不允许使用，而對於禁用的角色，所有隊伍都不允許使用。
            </p>
            <br />
            <p className="rule-title">✦每局積分規則</p>
            <p>
              {" "}
              每局比賽的上下半場，隊伍將根據以下規則獲得相應積分：
              <br />
              比賽結束時，逃脫人數 0 人，求生者方 0 分，監管者方 5 分<br />
              比賽結束時，逃脫人數 1 人，求生者方 1 分，監管者方 3 分<br />
              比賽結束時，逃脫人數 2 人，求生者方 2 分，監管者方 2 分<br />
              比賽結束時，逃脫人數 3 人，求生者方 3 分，監管者方 1 分<br />
              比賽結束時，逃脫人數 4 人，求生者方 5 分，監管者方 0 分<br />
              每局比賽判定勝負的條件為上下半場兩隊的積分之總和，每局比賽（包括上下半場）積分之總和較高的隊伍獲得本局比賽勝利，反之失敗。
              <br />
              回合數為 BO3 的比賽中，如果隊伍在前兩局取得 2 勝 0
              負，那麼該隊伍即取得該場比賽勝利，不用進行第三局比賽；如果隊伍在前兩局取得
              1 勝 1 平、1 勝 1 負或 2平，則需要進行第三局比賽。
              <br />
              回合數為 BO5 的比賽中，如果隊伍在前三局取得 3 勝 0
              負，或在前四局取得 3 勝 1 平、2 勝 2
              平，則該場比賽已分出勝負，否則還需要進行接下來的比賽局數。{" "}
            </p>
            <br />
            <p className="rule-title">✦比賽同分規則</p>
            <p>
              {" "}
              BO1同分勝負判定：
              <br />
              若出現同分情況，先以比賽時間為判定依據。首先判斷雙方隊伍作為求生者時是否有隊員成功逃生：若至少有一個求生者逃生，則以隊伍成員作為求生者陣營時比賽時間作為判定依據，時間短者獲勝；若雙方戰隊作為求生者時均無人逃脫，則以隊伍成員作為監管者陣營時比賽時間作為判定依據，時間短者獲勝。
              <br />
              BO3 及 BO 5 的賽事中出現平局的情況，則依次按如下規則進行判定：
              <br />
              1）先比較整場比賽的總積分（每局比賽的積分總和），積分高者勝利。
              <br />
              2）如果積分相同，則加時一輪
              BO1。所加輪次會根據雙方積分高低判定勝負。
              <br />
              3）若加賽時仍出現雙方積分相同的情況，則首先判斷雙方隊伍擔任求生者時是否有隊員成功逃生：若至少有一個求生者逃生，則以隊伍成員擔任求生者陣營時比賽時間作為判定依據，時間短者獲勝；若雙方隊伍擔任求生者時均無人逃脫，則以隊伍成員擔任監管者陣營時比賽時間作為判定依據，時間短者獲勝。
              <br />
              BO3 和 BO5 比賽中的加賽禁用規則均與上一輪比賽相同，即 BO3
              的比賽中加賽的 BP 規則與第三局一樣，BO5 的比賽中加賽 BP
              規則與第五局一樣。
            </p>
            <br />
            <p className="rule-title">✦比賽帳號</p>
            <p>
              {" "}
              【線上預賽&八強後線下賽】選手需要使用自己的帳號進行比賽，不得借用他人帳號進行比賽。為了保證賽事的正常進行，官方有權根據實際情況要求選手更換官方提供的帳號進行比賽。
            </p>
            <br />
            <p className="rule-title">✦比賽設備</p>
            <p>
              {" "}
              【線上預賽&八強後線下賽】賽事期間選手需要自備比賽用機且必須為手機（皆嚴禁使用
              PC 端或模擬器）。
              <br />
              選手互相之間可以進行口頭上或使用遊戲內語音聊天頻道或其他溝通軟體進行語言溝通。為了賽事正常有序進行，裁判有權要求選手統一使用指定的軟體進行溝通。
              <br />
              選手有責任在比賽開始前確認好手機（包括手機電量、手機設定、遊戲設定等）和通話設備，如果由於選手設備調試不足，導致在比賽過程中出現設備異常等情況，裁判有權決定比賽繼續進行或是直接判定勝負。
            </p>
            <br />
            <p className="rule-title">✦隊伍成員</p>
            <p>
              {" "}
              每支隊伍由 5 名先發隊員和最多 2
              名替補隊員組成，如果選手上場人數不足 5 人
              則將被取消資格。各隊伍名單在報名後鎖定，不能再進行人員變動。
              <br />
              隊伍資訊提交和變更以隊長為准，如果需要更換先發隊員，需要在每場比賽報到時或每小局休息時告知裁判。
              <br />
              每場 BO3 比賽中，隊伍有 1 次更換替補選手上場的機會；每場 BO5
              比賽中，隊伍有 2 次更換替補選手上場的機會。
              <br />
              每場比賽已經上場的選手之間不得互換位置（如果選手在某一場比賽中不能即作為監管者又作為求生者上場）。
            </p>
            <br />
            <p className="rule-title">✦參賽年齡</p>
            <p>
              {" "}
              本活動之參加者限居住於台港澳區之年滿15歲之合法居民參加，20歲以下參加者須徵得家長或監護人同意，主辦方保留審核參加者資格之權利。
            </p>
            <br />
            <p className="rule-title">✦報名資格</p>
            <p>
              {" "}
              參賽選手除上述年齡限制外，也須為台港澳合法居民。
              <br />
              報名時須上傳：主要以身分證為主，需為清晰可分辨的照片、掃描件或截圖。
              <br />
              ※如經查上傳之身分證件為造假，一律取消隊伍報名資格
            </p>
            <br />
            <p className="rule-title">✦戰隊名稱</p>
            <p>
              {" "}
              戰隊需要具有符合賽事規定的戰隊名稱，各戰隊不得使用相同的名稱，對於名稱接近的戰隊，賽事官方有權要求戰隊進行名稱更換。戰隊名稱如果為中文字，需要控制在
              6 個 中文字符內，如果為英文，需要控制在 12
              個字符內，且戰隊名稱中不能出現暴力、謾駡、色情、違背比賽規則及善良風俗的文字。
            </p>
            <br />
            <p className="rule-title">✦網路設備及遊戲異常說明</p>
            <p>
              {" "}
              線上淘汰賽階段，選手需要對自身比賽的遊戲網路負責。若果出現選手斷線或線路異常的情況，裁判有權要求比賽繼續進行，並視為比賽結果有效。如果比賽過程中出現伺服器異常或者遊戲端
              BUG，且對比賽產生不可逆的影響，裁判將同官方根據實際情況判定是否進行重賽。
              如果比賽過程中出現重賽，所有角色、地圖、技能和人格天賦的選擇需要與重賽前保持一致，如果出現選擇不一致的情況，裁判有權要求選手進行調整直到所有選擇與重賽前一致。對於惡意修改角色技能和天賦點的行為，將視情節嚴重性給予警告處罰或是直接判定當局勝負。
            </p>
            <br />
            <p className="rule-title">✦賽事異議</p>
            <p>
              {" "}
              當比賽過程中出現爭議時，隊長和選手應無條件服從裁判判罰。如果選手對裁判所提出判決有異議，依據申述流程向賽事官方進行申訴。
              選手申述流程為每局比賽結束後三分鐘內，和線上/線下裁判進行申述。超出時間限制，裁判及賽事官方有權不受理該申述。
            </p>
            <br />
            <p className="rule-title">✦作弊與懲罰</p>
            <p>
              {" "}
              比賽禁止使用任何非經官方授權核可的輔助工具，修改遊戲內部內容，如遊戲介面、音效、角色技能等。如有選手違反此項規則，一律按照使用外掛處理，隊伍將被取消比賽資格及獎金。
              <br />
              比賽過程中禁止使用非第五人格遊戲內正規管道獲取的道具和角色，或官方未正式發布的道具和角色。如有選手違反此項規則，一律按照使用外掛處理，團隊將被取消比賽資格及獎金。
            </p>
            <br />
            <p className="rule-title">✦運動家精神</p>
            <p>
              參賽選手（或隊伍）在比賽中應具備運動家精神，比賽時禁止涉及宗教、歧視、政治及侮辱之動作及內容、禁止消極比賽、虛假比賽，一經發現則取消比賽資格及隊伍獎金。
              賽事期間，禁止選手委託他人進行比賽（包括但不限於將個人帳號或設備交由他人進行操作），亦不得代替其他選手進行比賽。以上行為一經觸犯且證明，官方將取消該隊伍資格，並取消發放獎金及名次獎勵。
            </p>
            <br />
            <p className="rule-title">✦賽事棄權</p>
            <p>
              {" "}
              第五人格賽事原則上禁止隊伍棄權，若隊伍在報到時間10分鐘內未到，則判定隊伍棄權。
            </p>
            <br />
            <p className="rule-title">✦選手直播</p>
            <p>
              {" "}
              在比賽過程中，所有參賽選手個人及隊伍不得進行網路直播，若經發現，取消隊伍參賽資格並取消獎金及名次獎勵。{" "}
            </p>
            <br />
            <p className="rule-title">✦隊伍延誤</p>
            <p>
              {" "}
              賽前延誤
              <br />
              若隊伍在報到時間10分鐘內未進行報到手續，則判定隊伍棄權。
              <br />
              賽中延誤
              <br />
              如果比賽過程中，隊伍有選手失聯或其他原因導致無法正常進行比賽，則該隊伍有10分鐘的時間聯絡其替補選手進行比賽（該替補選手需要在已報名的隊伍名單內）。如果該隊伍在規定時間內無法補齊選手進行參賽，則官方有權判定該隊伍棄權。
            </p>
            <br />
            <p className="rule-title">✦直播影像</p>
            <p>
              {" "}
              選手參與本次比賽所產生的直播內容、影片、Replay
              等素材使用權歸第五人格官方所有，所有參賽選手必須接受後方可參賽。{" "}
            </p>
            <br />
            <p className="rule-title">✦聯絡官方</p>
            <p>
              {" "}
              若有任何事項需要聯絡賽事官方，請來信至下列信箱：EventCS@funplusesport.com{" "}
            </p>
          </div>
        </div>
        <a className="match1" href="/idvtwcampus/team" target="_blank">
          {" "}
        </a>{" "}
      </section>
    </Fragment>
  );
};

export default Section3Rule;
